from piper_phonemize import phonemize_espeak

words = ["系鞋带", "种花", "干活", "饕餮", "蹙眉", "数一下", "你得",
         "参差", "种子", "蹒跚", "氤氲", "缱绻", "耄耋", "讪笑",
         "银行", "行长", "行业", "重要", "重新", "还是", "归还",
         "音乐", "乐器", "长江", "长大", "觉得", "记得", "背包", "背景",
         "空调", "调查", "出差", "着急", "拿着", "为了", "因为", "发现",
         "头发", "数字", "有空", "空气", "干净", "处理", "上传", "传记",
         "关系", "角度", "角色", "效率", "方便", "便宜", "参加", "人参",
         "薄饼", "薄弱", "露天", "露面"]
for w in words:
    ph = [p for sent in phonemize_espeak(w, "cmn") for p in sent]
    print(w, "|", " ".join(ph))
